Revit 2024 API
ScheduleField.SetStyle Method
 Sets the style of this field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void SetStyle(
	TableCellStyle style
)
Visual Basic
Public Sub SetStyle ( _
	style As TableCellStyle _
)
Visual C++
public:
void SetStyle(
	TableCellStyle^ style
)
Parameters
style
Type: Autodesk.Revit.DB.TableCellStyle
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ScheduleField Class
Autodesk.Revit.DB Namespace